benchmark-results/event-throughput-output.txt

         /\      Grafana   /‾‾/  
    /\  /  \     |\  __   /  /   
   /  \/    \    | |/ /  /   ‾‾\ 
  /          \   |   (  |  (‾)  |
 / __________ \  |_|\_\  \_____/ 


     execution: local
        script: tests/load/event-throughput-test.js
        output: json (./benchmark-results/event-throughput-results.json)

     scenarios: (100.00%) 1 scenario, 200 max VUs, 2m30s max duration (incl. graceful stop):
              * event_burst: 175.00 iterations/s for 2m0s (maxVUs: 50-200, gracefulStop: 30s)


running (0m00.9s), 001/050 VUs, 163 complete and 0 interrupted iterations
event_burst   [   1% ] 001/050 VUs  0m00.9s/2m0s  175.00 iters/s

running (0m01.9s), 001/050 VUs, 338 complete and 0 interrupted iterations
event_burst   [   2% ] 001/050 VUs  0m01.9s/2m0s  175.00 iters/s

running (0m02.9s), 002/050 VUs, 512 complete and 0 interrupted iterations
event_burst   [   2% ] 002/050 VUs  0m02.9s/2m0s  175.00 iters/s

running (0m03.9s), 001/050 VUs, 688 complete and 0 interrupted iterations
event_burst   [   3% ] 001/050 VUs  0m03.9s/2m0s  175.00 iters/s

running (0m04.9s), 001/050 VUs, 863 complete and 0 interrupted iterations
event_burst   [   4% ] 001/050 VUs  0m04.9s/2m0s  175.00 iters/s

running (0m05.9s), 001/050 VUs, 1038 complete and 0 interrupted iterations
event_burst   [   5% ] 001/050 VUs  0m05.9s/2m0s  175.00 iters/s

running (0m06.9s), 001/050 VUs, 1213 complete and 0 interrupted iterations
event_burst   [   6% ] 001/050 VUs  0m06.9s/2m0s  175.00 iters/s

running (0m07.9s), 001/050 VUs, 1388 complete and 0 interrupted iterations
event_burst   [   7% ] 001/050 VUs  0m07.9s/2m0s  175.00 iters/s

running (0m08.9s), 001/050 VUs, 1563 complete and 0 interrupted iterations
event_burst   [   7% ] 001/050 VUs  0m08.9s/2m0s  175.00 iters/s

running (0m09.9s), 001/050 VUs, 1738 complete and 0 interrupted iterations
event_burst   [   8% ] 001/050 VUs  0m09.9s/2m0s  175.00 iters/s

running (0m10.9s), 001/050 VUs, 1913 complete and 0 interrupted iterations
event_burst   [   9% ] 001/050 VUs  0m10.9s/2m0s  175.00 iters/s

running (0m11.9s), 001/050 VUs, 2088 complete and 0 interrupted iterations
event_burst   [  10% ] 001/050 VUs  0m11.9s/2m0s  175.00 iters/s

running (0m12.9s), 001/050 VUs, 2263 complete and 0 interrupted iterations
event_burst   [  11% ] 001/050 VUs  0m12.9s/2m0s  175.00 iters/s

running (0m13.9s), 001/050 VUs, 2438 complete and 0 interrupted iterations
event_burst   [  12% ] 001/050 VUs  0m13.9s/2m0s  175.00 iters/s

running (0m14.9s), 001/050 VUs, 2613 complete and 0 interrupted iterations
event_burst   [  12% ] 001/050 VUs  0m14.9s/2m0s  175.00 iters/s

running (0m15.9s), 001/050 VUs, 2788 complete and 0 interrupted iterations
event_burst   [  13% ] 001/050 VUs  0m15.9s/2m0s  175.00 iters/s

running (0m16.9s), 002/050 VUs, 2962 complete and 0 interrupted iterations
event_burst   [  14% ] 002/050 VUs  0m16.9s/2m0s  175.00 iters/s

running (0m17.9s), 001/050 VUs, 3138 complete and 0 interrupted iterations
event_burst   [  15% ] 001/050 VUs  0m17.9s/2m0s  175.00 iters/s

running (0m18.9s), 001/050 VUs, 3313 complete and 0 interrupted iterations
event_burst   [  16% ] 001/050 VUs  0m18.9s/2m0s  175.00 iters/s

running (0m19.9s), 003/050 VUs, 3486 complete and 0 interrupted iterations
event_burst   [  17% ] 003/050 VUs  0m19.9s/2m0s  175.00 iters/s

running (0m20.9s), 001/050 VUs, 3663 complete and 0 interrupted iterations
event_burst   [  17% ] 001/050 VUs  0m20.9s/2m0s  175.00 iters/s

running (0m21.9s), 001/050 VUs, 3838 complete and 0 interrupted iterations
event_burst   [  18% ] 001/050 VUs  0m21.9s/2m0s  175.00 iters/s

running (0m22.9s), 001/050 VUs, 4013 complete and 0 interrupted iterations
event_burst   [  19% ] 001/050 VUs  0m22.9s/2m0s  175.00 iters/s

running (0m23.9s), 001/050 VUs, 4188 complete and 0 interrupted iterations
event_burst   [  20% ] 001/050 VUs  0m23.9s/2m0s  175.00 iters/s

running (0m24.9s), 002/050 VUs, 4362 complete and 0 interrupted iterations
event_burst   [  21% ] 002/050 VUs  0m24.9s/2m0s  175.00 iters/s

running (0m25.9s), 001/050 VUs, 4538 complete and 0 interrupted iterations
event_burst   [  22% ] 001/050 VUs  0m25.9s/2m0s  175.00 iters/s

running (0m26.9s), 001/050 VUs, 4713 complete and 0 interrupted iterations
event_burst   [  22% ] 001/050 VUs  0m26.9s/2m0s  175.00 iters/s

running (0m27.9s), 001/050 VUs, 4888 complete and 0 interrupted iterations
event_burst   [  23% ] 001/050 VUs  0m27.9s/2m0s  175.00 iters/s

running (0m28.9s), 001/050 VUs, 5063 complete and 0 interrupted iterations
event_burst   [  24% ] 001/050 VUs  0m28.9s/2m0s  175.00 iters/s

running (0m29.9s), 001/050 VUs, 5238 complete and 0 interrupted iterations
event_burst   [  25% ] 001/050 VUs  0m29.9s/2m0s  175.00 iters/s

running (0m30.9s), 001/050 VUs, 5413 complete and 0 interrupted iterations
event_burst   [  26% ] 001/050 VUs  0m30.9s/2m0s  175.00 iters/s

running (0m31.9s), 002/050 VUs, 5587 complete and 0 interrupted iterations
event_burst   [  27% ] 002/050 VUs  0m31.9s/2m0s  175.00 iters/s

running (0m32.9s), 001/050 VUs, 5763 complete and 0 interrupted iterations
event_burst   [  27% ] 001/050 VUs  0m32.9s/2m0s  175.00 iters/s

running (0m33.9s), 001/050 VUs, 5938 complete and 0 interrupted iterations
event_burst   [  28% ] 001/050 VUs  0m33.9s/2m0s  175.00 iters/s

running (0m34.9s), 001/050 VUs, 6113 complete and 0 interrupted iterations
event_burst   [  29% ] 001/050 VUs  0m34.9s/2m0s  175.00 iters/s

running (0m35.9s), 006/050 VUs, 6283 complete and 0 interrupted iterations
event_burst   [  30% ] 006/050 VUs  0m35.9s/2m0s  175.00 iters/s

running (0m36.9s), 001/050 VUs, 6463 complete and 0 interrupted iterations
event_burst   [  31% ] 001/050 VUs  0m36.9s/2m0s  175.00 iters/s

running (0m37.9s), 001/050 VUs, 6638 complete and 0 interrupted iterations
event_burst   [  32% ] 001/050 VUs  0m37.9s/2m0s  175.00 iters/s

running (0m38.9s), 001/050 VUs, 6813 complete and 0 interrupted iterations
event_burst   [  32% ] 001/050 VUs  0m38.9s/2m0s  175.00 iters/s

running (0m39.9s), 001/050 VUs, 6988 complete and 0 interrupted iterations
event_burst   [  33% ] 001/050 VUs  0m39.9s/2m0s  175.00 iters/s

running (0m40.9s), 001/050 VUs, 7163 complete and 0 interrupted iterations
event_burst   [  34% ] 001/050 VUs  0m40.9s/2m0s  175.00 iters/s

running (0m41.9s), 001/050 VUs, 7338 complete and 0 interrupted iterations
event_burst   [  35% ] 001/050 VUs  0m41.9s/2m0s  175.00 iters/s

running (0m42.9s), 001/050 VUs, 7513 complete and 0 interrupted iterations
event_burst   [  36% ] 001/050 VUs  0m42.9s/2m0s  175.00 iters/s

running (0m43.9s), 001/050 VUs, 7688 complete and 0 interrupted iterations
event_burst   [  37% ] 001/050 VUs  0m43.9s/2m0s  175.00 iters/s

running (0m44.9s), 002/050 VUs, 7862 complete and 0 interrupted iterations
event_burst   [  37% ] 002/050 VUs  0m44.9s/2m0s  175.00 iters/s

running (0m45.9s), 001/050 VUs, 8038 complete and 0 interrupted iterations
event_burst   [  38% ] 001/050 VUs  0m45.9s/2m0s  175.00 iters/s

running (0m46.9s), 001/050 VUs, 8213 complete and 0 interrupted iterations
event_burst   [  39% ] 001/050 VUs  0m46.9s/2m0s  175.00 iters/s

running (0m47.9s), 001/050 VUs, 8388 complete and 0 interrupted iterations
event_burst   [  40% ] 001/050 VUs  0m47.9s/2m0s  175.00 iters/s

running (0m48.9s), 001/050 VUs, 8563 complete and 0 interrupted iterations
event_burst   [  41% ] 001/050 VUs  0m48.9s/2m0s  175.00 iters/s

running (0m49.9s), 001/050 VUs, 8738 complete and 0 interrupted iterations
event_burst   [  42% ] 001/050 VUs  0m49.9s/2m0s  175.00 iters/s

running (0m50.9s), 002/050 VUs, 8912 complete and 0 interrupted iterations
event_burst   [  42% ] 002/050 VUs  0m50.9s/2m0s  175.00 iters/s

running (0m51.9s), 001/050 VUs, 9088 complete and 0 interrupted iterations
event_burst   [  43% ] 001/050 VUs  0m51.9s/2m0s  175.00 iters/s

running (0m52.9s), 001/050 VUs, 9263 complete and 0 interrupted iterations
event_burst   [  44% ] 001/050 VUs  0m52.9s/2m0s  175.00 iters/s

running (0m53.9s), 001/050 VUs, 9438 complete and 0 interrupted iterations
event_burst   [  45% ] 001/050 VUs  0m53.9s/2m0s  175.00 iters/s

running (0m54.9s), 001/050 VUs, 9613 complete and 0 interrupted iterations
event_burst   [  46% ] 001/050 VUs  0m54.9s/2m0s  175.00 iters/s

running (0m55.9s), 001/050 VUs, 9788 complete and 0 interrupted iterations
event_burst   [  47% ] 001/050 VUs  0m55.9s/2m0s  175.00 iters/s

running (0m56.9s), 001/050 VUs, 9963 complete and 0 interrupted iterations
event_burst   [  47% ] 001/050 VUs  0m56.9s/2m0s  175.00 iters/s

running (0m57.9s), 001/050 VUs, 10138 complete and 0 interrupted iterations
event_burst   [  48% ] 001/050 VUs  0m57.9s/2m0s  175.00 iters/s

running (0m58.9s), 001/050 VUs, 10313 complete and 0 interrupted iterations
event_burst   [  49% ] 001/050 VUs  0m58.9s/2m0s  175.00 iters/s

running (0m59.9s), 001/050 VUs, 10488 complete and 0 interrupted iterations
event_burst   [  50% ] 001/050 VUs  0m59.9s/2m0s  175.00 iters/s

running (1m00.9s), 001/050 VUs, 10663 complete and 0 interrupted iterations
event_burst   [  51% ] 001/050 VUs  1m00.9s/2m0s  175.00 iters/s

running (1m01.9s), 001/050 VUs, 10838 complete and 0 interrupted iterations
event_burst   [  52% ] 001/050 VUs  1m01.9s/2m0s  175.00 iters/s

running (1m02.9s), 001/050 VUs, 11013 complete and 0 interrupted iterations
event_burst   [  52% ] 001/050 VUs  1m02.9s/2m0s  175.00 iters/s

running (1m03.9s), 001/050 VUs, 11188 complete and 0 interrupted iterations
event_burst   [  53% ] 001/050 VUs  1m03.9s/2m0s  175.00 iters/s

running (1m04.9s), 002/050 VUs, 11362 complete and 0 interrupted iterations
event_burst   [  54% ] 002/050 VUs  1m04.9s/2m0s  175.00 iters/s

running (1m05.9s), 001/050 VUs, 11538 complete and 0 interrupted iterations
event_burst   [  55% ] 001/050 VUs  1m05.9s/2m0s  175.00 iters/s

running (1m06.9s), 001/050 VUs, 11713 complete and 0 interrupted iterations
event_burst   [  56% ] 001/050 VUs  1m06.9s/2m0s  175.00 iters/s

running (1m07.9s), 004/050 VUs, 11885 complete and 0 interrupted iterations
event_burst   [  57% ] 004/050 VUs  1m07.9s/2m0s  175.00 iters/s

running (1m08.9s), 001/050 VUs, 12063 complete and 0 interrupted iterations
event_burst   [  57% ] 001/050 VUs  1m08.9s/2m0s  175.00 iters/s

running (1m09.9s), 001/050 VUs, 12238 complete and 0 interrupted iterations
event_burst   [  58% ] 001/050 VUs  1m09.9s/2m0s  175.00 iters/s

running (1m10.9s), 001/050 VUs, 12413 complete and 0 interrupted iterations
event_burst   [  59% ] 001/050 VUs  1m10.9s/2m0s  175.00 iters/s

running (1m11.9s), 001/050 VUs, 12588 complete and 0 interrupted iterations
event_burst   [  60% ] 001/050 VUs  1m11.9s/2m0s  175.00 iters/s

running (1m12.9s), 001/050 VUs, 12763 complete and 0 interrupted iterations
event_burst   [  61% ] 001/050 VUs  1m12.9s/2m0s  175.00 iters/s

running (1m13.9s), 001/050 VUs, 12938 complete and 0 interrupted iterations
event_burst   [  62% ] 001/050 VUs  1m13.9s/2m0s  175.00 iters/s

running (1m14.9s), 001/050 VUs, 13113 complete and 0 interrupted iterations
event_burst   [  62% ] 001/050 VUs  1m14.9s/2m0s  175.00 iters/s

running (1m15.9s), 001/050 VUs, 13288 complete and 0 interrupted iterations
event_burst   [  63% ] 001/050 VUs  1m15.9s/2m0s  175.00 iters/s

running (1m16.9s), 001/050 VUs, 13463 complete and 0 interrupted iterations
event_burst   [  64% ] 001/050 VUs  1m16.9s/2m0s  175.00 iters/s

running (1m17.9s), 001/050 VUs, 13638 complete and 0 interrupted iterations
event_burst   [  65% ] 001/050 VUs  1m17.9s/2m0s  175.00 iters/s

running (1m18.9s), 001/050 VUs, 13813 complete and 0 interrupted iterations
event_burst   [  66% ] 001/050 VUs  1m18.9s/2m0s  175.00 iters/s

running (1m19.9s), 003/050 VUs, 13986 complete and 0 interrupted iterations
event_burst   [  67% ] 003/050 VUs  1m19.9s/2m0s  175.00 iters/s

running (1m20.9s), 001/050 VUs, 14163 complete and 0 interrupted iterations
event_burst   [  67% ] 001/050 VUs  1m20.9s/2m0s  175.00 iters/s

running (1m21.9s), 001/050 VUs, 14338 complete and 0 interrupted iterations
event_burst   [  68% ] 001/050 VUs  1m21.9s/2m0s  175.00 iters/s

running (1m22.9s), 001/050 VUs, 14513 complete and 0 interrupted iterations
event_burst   [  69% ] 001/050 VUs  1m22.9s/2m0s  175.00 iters/s

running (1m23.9s), 001/050 VUs, 14688 complete and 0 interrupted iterations
event_burst   [  70% ] 001/050 VUs  1m23.9s/2m0s  175.00 iters/s

running (1m24.9s), 001/050 VUs, 14863 complete and 0 interrupted iterations
event_burst   [  71% ] 001/050 VUs  1m24.9s/2m0s  175.00 iters/s

running (1m25.9s), 001/050 VUs, 15038 complete and 0 interrupted iterations
event_burst   [  72% ] 001/050 VUs  1m25.9s/2m0s  175.00 iters/s

running (1m26.9s), 001/050 VUs, 15213 complete and 0 interrupted iterations
event_burst   [  72% ] 001/050 VUs  1m26.9s/2m0s  175.00 iters/s

running (1m27.9s), 001/050 VUs, 15388 complete and 0 interrupted iterations
event_burst   [  73% ] 001/050 VUs  1m27.9s/2m0s  175.00 iters/s

running (1m28.9s), 001/050 VUs, 15563 complete and 0 interrupted iterations
event_burst   [  74% ] 001/050 VUs  1m28.9s/2m0s  175.00 iters/s

running (1m29.9s), 001/050 VUs, 15738 complete and 0 interrupted iterations
event_burst   [  75% ] 001/050 VUs  1m29.9s/2m0s  175.00 iters/s

running (1m30.9s), 001/050 VUs, 15913 complete and 0 interrupted iterations
event_burst   [  76% ] 001/050 VUs  1m30.9s/2m0s  175.00 iters/s

running (1m31.9s), 001/050 VUs, 16088 complete and 0 interrupted iterations
event_burst   [  77% ] 001/050 VUs  1m31.9s/2m0s  175.00 iters/s

running (1m32.9s), 001/050 VUs, 16263 complete and 0 interrupted iterations
event_burst   [  77% ] 001/050 VUs  1m32.9s/2m0s  175.00 iters/s

running (1m33.9s), 002/050 VUs, 16437 complete and 0 interrupted iterations
event_burst   [  78% ] 002/050 VUs  1m33.9s/2m0s  175.00 iters/s

running (1m34.9s), 001/050 VUs, 16613 complete and 0 interrupted iterations
event_burst   [  79% ] 001/050 VUs  1m34.9s/2m0s  175.00 iters/s

running (1m35.9s), 001/050 VUs, 16788 complete and 0 interrupted iterations
event_burst   [  80% ] 001/050 VUs  1m35.9s/2m0s  175.00 iters/s

running (1m36.9s), 001/050 VUs, 16963 complete and 0 interrupted iterations
event_burst   [  81% ] 001/050 VUs  1m36.9s/2m0s  175.00 iters/s

running (1m37.9s), 001/050 VUs, 17138 complete and 0 interrupted iterations
event_burst   [  82% ] 001/050 VUs  1m37.9s/2m0s  175.00 iters/s

running (1m38.9s), 001/050 VUs, 17313 complete and 0 interrupted iterations
event_burst   [  82% ] 001/050 VUs  1m38.9s/2m0s  175.00 iters/s

running (1m39.9s), 001/050 VUs, 17488 complete and 0 interrupted iterations
event_burst   [  83% ] 001/050 VUs  1m39.9s/2m0s  175.00 iters/s

running (1m40.9s), 001/050 VUs, 17663 complete and 0 interrupted iterations
event_burst   [  84% ] 001/050 VUs  1m40.9s/2m0s  175.00 iters/s

running (1m41.9s), 001/050 VUs, 17838 complete and 0 interrupted iterations
event_burst   [  85% ] 001/050 VUs  1m41.9s/2m0s  175.00 iters/s

running (1m42.9s), 001/050 VUs, 18013 complete and 0 interrupted iterations
event_burst   [  86% ] 001/050 VUs  1m42.9s/2m0s  175.00 iters/s

running (1m43.9s), 001/050 VUs, 18188 complete and 0 interrupted iterations
event_burst   [  87% ] 001/050 VUs  1m43.9s/2m0s  175.00 iters/s

running (1m44.9s), 001/050 VUs, 18363 complete and 0 interrupted iterations
event_burst   [  87% ] 001/050 VUs  1m44.9s/2m0s  175.00 iters/s

running (1m45.9s), 001/050 VUs, 18538 complete and 0 interrupted iterations
event_burst   [  88% ] 001/050 VUs  1m45.9s/2m0s  175.00 iters/s

running (1m46.9s), 001/050 VUs, 18713 complete and 0 interrupted iterations
event_burst   [  89% ] 001/050 VUs  1m46.9s/2m0s  175.00 iters/s

running (1m47.9s), 001/050 VUs, 18888 complete and 0 interrupted iterations
event_burst   [  90% ] 001/050 VUs  1m47.9s/2m0s  175.00 iters/s

running (1m48.9s), 001/050 VUs, 19063 complete and 0 interrupted iterations
event_burst   [  91% ] 001/050 VUs  1m48.9s/2m0s  175.00 iters/s

running (1m49.9s), 004/050 VUs, 19235 complete and 0 interrupted iterations
event_burst   [  92% ] 004/050 VUs  1m49.9s/2m0s  175.00 iters/s

running (1m50.9s), 004/050 VUs, 19411 complete and 0 interrupted iterations
event_burst   [  92% ] 004/050 VUs  1m50.9s/2m0s  175.00 iters/s

running (1m51.9s), 001/050 VUs, 19588 complete and 0 interrupted iterations
event_burst   [  93% ] 001/050 VUs  1m51.9s/2m0s  175.00 iters/s

running (1m52.9s), 001/050 VUs, 19763 complete and 0 interrupted iterations
event_burst   [  94% ] 001/050 VUs  1m52.9s/2m0s  175.00 iters/s

running (1m53.9s), 001/050 VUs, 19938 complete and 0 interrupted iterations
event_burst   [  95% ] 001/050 VUs  1m53.9s/2m0s  175.00 iters/s

running (1m54.9s), 001/050 VUs, 20113 complete and 0 interrupted iterations
event_burst   [  96% ] 001/050 VUs  1m54.9s/2m0s  175.00 iters/s

running (1m55.9s), 001/050 VUs, 20288 complete and 0 interrupted iterations
event_burst   [  97% ] 001/050 VUs  1m55.9s/2m0s  175.00 iters/s

running (1m56.9s), 001/050 VUs, 20463 complete and 0 interrupted iterations
event_burst   [  97% ] 001/050 VUs  1m56.9s/2m0s  175.00 iters/s

running (1m57.9s), 001/050 VUs, 20638 complete and 0 interrupted iterations
event_burst   [  98% ] 001/050 VUs  1m57.9s/2m0s  175.00 iters/s

running (1m58.9s), 004/050 VUs, 20810 complete and 0 interrupted iterations
event_burst   [  99% ] 004/050 VUs  1m58.9s/2m0s  175.00 iters/s

running (1m59.9s), 001/050 VUs, 20988 complete and 0 interrupted iterations
event_burst   [ 100% ] 001/050 VUs  1m59.9s/2m0s  175.00 iters/s
time="2026-05-05T19:17:07-04:00" level=error msg="TypeError: Cannot read property 'toFixed' of undefined or null\n\tat handleSummary (file:///home/prayag/notification-engine/tests/load/event-throughput-test.js:106:55(80))\n" hint="script exception"


  █ THRESHOLDS 

    event_publish_errors
    ✓ 'rate<0.05' rate=0.00%

    event_publish_latency_ms
    ✓ 'p(95)<200' p(95)=20

    events_published
    ✓ 'count>20000' count=21001

    http_req_duration
    ✓ 'p(95)<300' p(95)=19.35ms


  █ TOTAL RESULTS 

    checks_total.......: 42002   350.001385/s
    checks_succeeded...: 100.00% 42002 out of 42002
    checks_failed......: 0.00%   0 out of 42002

    ✓ status is 200 or 201
    ✓ response has id

    CUSTOM
    event_publish_errors...........: 0.00%  0 out of 21001
    event_publish_latency_ms.......: avg=7.888958 min=3      med=6      max=66      p(90)=14      p(95)=20     
    events_published...............: 21001  175.000692/s

    HTTP
    http_req_duration..............: avg=7.75ms   min=3.44ms med=5.78ms max=66.44ms p(90)=14.13ms p(95)=19.35ms
      { expected_response:true }...: avg=7.75ms   min=3.44ms med=5.78ms max=66.44ms p(90)=14.13ms p(95)=19.35ms
    http_req_failed................: 0.00%  0 out of 21001
    http_reqs......................: 21001  175.000692/s

    EXECUTION
    iteration_duration.............: avg=8.05ms   min=3.6ms  med=6.02ms max=66.82ms p(90)=14.63ms p(95)=19.99ms
    iterations.....................: 21001  175.000692/s
    vus............................: 1      min=1          max=5 
    vus_max........................: 50     min=50         max=50

    NETWORK
    data_received..................: 7.0 MB 58 kB/s
    data_sent......................: 8.1 MB 68 kB/s



running (2m00.0s), 000/050 VUs, 21001 complete and 0 interrupted iterations
event_burst ✓ [ 100% ] 000/050 VUs  2m0s  175.00 iters/s